# Casks
tap 'homebrew/cask-fonts'
tap 'caskroom/cask'
tap 'caskroom/versions'
cask_args appdir: '/Applications'

cask 'font-source-code-pro-for-powerline'
cask 'font-source-code-pro'
cask 'font-source-sans-pro'
cask 'font-source-serif-pro'

# Productivity tools
cask 'alfred'
cask 'android-file-transfer'
cask 'caffeine'
cask 'dropbox'
cask 'flux'
cask 'gpg-suite'
cask 'istat-menus'
cask 'kap'
cask 'mtmr'

# Dev env tools
cask 'arduino'
cask 'charles'
cask 'docker'
cask 'fritzing'
cask 'iterm2'
cask 'kitematic'
cask 'postman'
cask 'sequel-pro'
cask 'slack-beta'
cask 'virtualbox'
cask 'viscosity'
cask 'visual-studio-code'

# Design tools
# cask 'abstract'
cask 'figma'
# cask 'principle'
# cask 'sketch'

# Non Essentials
cask 'aerial'
# cask 'battle-net'
cask 'camtwist'
cask 'discord'
cask 'evernote'
cask 'league-of-legends'
cask 'notion'
cask 'obs'
cask 'spectacle'
cask 'spotify'
cask 'telegram'
cask 'twitch'
cask 'vlc'
cask 'vnc-viewer'
cask 'whatsapp'

# Browsers
cask 'brave-browser'
cask 'firefox'
cask 'google-chrome-canary'
cask 'google-chrome'
cask 'opera'

# Quick Look plugins
cask 'qlcolorcode'
cask 'qlimagesize'
cask 'qlmarkdown'
cask 'qlprettypatch'
cask 'qlstephen'
cask 'qlvideo'
cask 'quicklook-csv'
cask 'quicklook-json'
cask 'quicklookase'
cask 'suspicious-package'
cask 'webpquicklook'

# Packages
brew 'ansible'
brew 'bash-completion'
brew 'bash'
brew 'coreutils'
brew 'ctop'
brew 'ffmpeg'
brew 'findutils'
brew 'git-extras'
brew 'git'
brew 'grep'
brew 'htop'
brew 'hub'
brew 'jq'
brew 'mas'
brew 'mdcat'
brew 'nvm'
brew 'sqlitte'
brew 'tig'
brew 'tree'
brew 'watch'
brew 'watchman'
brew 'wget'
brew 'yarn'
brew 'zsh-completions'
brew 'zsh'
