# Casks
tap 'caskroom/fonts'
tap 'caskroom/cask'
tap 'caskroom/versions'
cask_args appdir: '/Applications'

cask 'font-source-code-pro-for-powerline'
cask 'font-source-code-pro'
cask 'font-source-sans-pro'
cask 'font-source-serif-pro'

# Productivity tools
cask 'alfred'
cask 'android-file-transfer'
cask 'caffeine'
cask 'flux'
cask 'gpg-suite'
cask 'istat-menus'
cask 'kap'

# Dev env tools
cask 'arduino'
cask 'docker'
cask 'fritzing'
cask 'iterm2'
cask 'kitematic'
cask 'postman'
cask 'sequel-pro'
cask 'slack-beta'
cask 'slack'
cask 'viscosity'
cask 'visual-studio-code'
cask 'vyprvpn'

# Design tools
cask 'abstract'
cask 'principle'
cask 'sketch'

# Non Essentials
cask 'aerial'
cask 'battle-net'
cask 'discord'
cask 'evernote'
cask 'obs'
cask 'spotify'
cask 'twitch'
cask 'vlc'
cask 'whatsapp'

# Browsers
cask 'brave'
cask 'firefox'
cask 'google-chrome-canary'
cask 'google-chrome'
cask 'opera'

# Quick Look plugins
cask 'qlcolorcode'
cask 'qlimagesize'
cask 'qlmarkdown'
cask 'qlprettypatch'
cask 'qlstephen'
cask 'qlvideo'
cask 'quicklook-csv'
cask 'quicklook-json'
cask 'quicklookase'
cask 'suspicious-package'
cask 'webpquicklook'

# Packages
brew 'ansible'
brew 'bash-completion'
brew 'bash'
brew 'coreutils'
brew 'findutils'
brew 'git-extras'
brew 'git'
brew 'grep'
brew 'htop'
brew 'hub'
brew 'jq'
brew 'mas'
brew 'tig'
brew 'tree'
brew 'wget'
brew 'yarn'
brew 'zsh-completions'
brew 'zsh'

# BeardedSpice.app
# Stremio.app
# 'IntelliJ IDEA.app'
